app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "details", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "GF"], ["details", "Get a girlfriend "], ["created_at", "2018-05-05 08:18:09.905913"], ["updated_at", "2018-05-05 08:18:09.905913"]]
---
        task = Task.new(task_params)
        task.save